# ChangeType Properties

---
The ChangeType type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
ChangeType Class
Autodesk.Revit.DB Namespace